src/CF/DataProcessors/ВыгрузкаТоваровВПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаТоваровВПодключаемоеОборудование</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/CF/InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихКодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихКода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихКодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекомендуемыйМинимальныйОстатокТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланкаКоличестваДляЛьготнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтслеживатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьУказаниеБезСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/DataProcessors/ВыгрузкаТоваровВПодключаемоеОборудование/Forms/Форма/Ext/Form/Module.bsl
// sza131005-0234 : 
&НаКлиенте
Процедура ВыгрузитьВыполнить()

	ОчиститьСообщения();
	
	Если ПустаяСтрока(ТипОборудования) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не выбран тип оборудования.'"));
		Возврат;
	КонецЕсли;
	
	ТаблицаЗагрузкиТоваров = Новый Массив;
	
	Если ТипОборудования = "Весы" Тогда
		Для Каждого Товар ИЗ ТаблицаВыгрузки Цикл
			ТаблицаЗагрузкиТоваров.Добавить(Новый Структура("PLU, Код, Номенклатура, НаименованиеПолное, Цена",
			  Товар.PLU, Товар.SKU, Товар.Наименование, Товар.Наименование + " " + Товар.Характеристика, Товар.Цена ));
		КонецЦикла;
		МенеджерОборудованияКлиент.ВыгрузитьДанныеВВесыСПечатьюЭтикеток(УникальныйИдентификатор, ТаблицаЗагрузкиТоваров);
	ИначеЕсли ТипОборудования = "ККМ" Тогда
		Для Каждого Товар ИЗ ТаблицаВыгрузки Цикл
			ТаблицаЗагрузкиТоваров.Добавить(Новый Структура("Код, Артикул, ШтрихКод, Наименование, НаименованиеПолное, ЕдиницаИзмерения, Цена, Остаток",
			  Товар.SKU, Товар.Артикул, Товар.ШтрихКод, Товар.Наименование, Товар.Наименование + " " + Товар.Характеристика, 
			  Товар.ЕдиницаИзмерения, Товар.Цена, 0));
		КонецЦикла;
		МенеджерОборудованияКлиент.ВыгрузитьДанныеВККМOffline(УникальныйИдентификатор, ТаблицаЗагрузкиТоваров);
	ИначеЕсли ТипОборудования = "ТСД" Тогда
		Для Каждого Товар ИЗ ТаблицаВыгрузки Цикл
			ТаблицаЗагрузкиТоваров.Добавить(Новый Структура("Код, ШтрихКод, Номенклатура, ЕдиницаИзмерения, ХарактеристикаНоменклатуры, СерияНоменклатуры, Качество, Цена, Остаток",
			Товар.SKU, Товар.ШтрихКод, Товар.Наименование, Товар.ЕдиницаИзмерения, Товар.Характеристика, Товар.Серия, Товар.Качество, Товар.Цена, 0));
		КонецЦикла;
		МенеджерОборудованияКлиент.ВыгрузитьДанныеВТСД(УникальныйИдентификатор, ТаблицаЗагрузкиТоваров);
	КонецЕсли;
	
КонецПроцедуры

// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
&НаСервере
Процедура ЗаполнитьБазуТоваров()

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование,
	|	ШтрихКоды.ШтрихКод КАК ШтрихКод,
	|	Номенклатура.Цена КАК Цена,
	|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Номенклатура.Характеристика КАК Характеристика,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Серия КАК Серия,
	|	Номенклатура.Качество КАК Качество,
	|	Номенклатура.PLU КАК PLU,
	|	Номенклатура.SKU КАК SKU
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ПО (ШтрихКоды.Номенклатура = Номенклатура.Ссылка)  
	|ГДЕ Номенклатура.ЭтоГруппа = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО ШтрихКоды.ШтрихКод");

	ТекТаблица = Запрос.Выполнить().Выгрузить();

	ЗначениеВРеквизитФормы(ТекТаблица, "ТаблицаВыгрузки");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыполнить()

	ЗаполнитьБазуТоваров();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокТоваров(Команда)
	
	ОчиститьСообщения();
	
	Если ПустаяСтрока(ТипОборудования) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не выбран тип оборудования.'"));
		Возврат;
	КонецЕсли;

	Если ТипОборудования = "Весы" Тогда
		МенеджерОборудованияКлиент.ОчиститьТоварыВВесахСПечатьюЭтикеток(УникальныйИдентификатор);
	ИначеЕсли ТипОборудования = "ККМ" Тогда
		МенеджерОборудованияКлиент.ОчиститьТоварыВККМOffline(УникальныйИдентификатор);
	ИначеЕсли ТипОборудования = "ТСД" Тогда
		МенеджерОборудованияКлиент.ОчиститьДанныеВТСД(УникальныйИдентификатор);
	КонецЕсли;
	           
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		

КонецПроцедуры
